---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings)
source: html/f60ebd5f-9da5-0699-6512-d7690e47b4d2.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.#ctor Method

Constructs a new copy of the input AnalysisDisplayMarkersAndTextSettings object.

## Syntax (C#)
```csharp
public AnalysisDisplayMarkersAndTextSettings(
	AnalysisDisplayMarkersAndTextSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null